**[Slide No. 7]**

1. Create  1-D array(series ) in pandas.

In [2]:
'''a=pd.Series(np.random.random(10))
a'''

'a=pd.Series(np.random.random(10))\na'

In [7]:
import pandas as pd
a=pd.Series([1,2,3],dtype=float)
a

0    1.0
1    2.0
2    3.0
dtype: float64

In [6]:
import pandas as pd
a=[5,2,7,4,1]     # create a list 
v=pd.Series(data=a)
v

0    5
1    2
2    7
3    4
4    1
dtype: int64

**[Slide No. 7]**

2. Create a pandas series from a list .

In [ ]:
import pandas as pd
a=[5,2,7,4,1]     # create a list 
v=pd.Series(data=a)
v

0    5
1    2
2    7
3    4
4    1
dtype: int64

**[Slide No. 8]**
3. Create a pandas series with user define index.

In [8]:
row_labels=['zeroth_row','first_row','second_row','third_row','fourth_row']
import pandas as pd
a=[5,2,7,4,1]     # create a list 
v=pd.Series(data=a,index=row_labels)
v

zeroth_row    5
first_row     2
second_row    7
third_row     4
fourth_row    1
dtype: int64

**[Slide No. 10]**

4. Write a program to create Dataframe by  Dictionay .

In [9]:
Dict={
    'Name':['KRish',"Krishan","Ram"],
    'Age':[25,23,34]
}
df=pd.DataFrame(Dict)
df

      Name  Age
0    KRish   25
1  Krishan   23
2      Ram   34

In [10]:
dict1={"Name":["Vikas","Aneya","Nilambari"],
       "Age":[37,35,8]}
df=pd.DataFrame(dict1)
df

        Name  Age
0      Vikas   37
1      Aneya   35
2  Nilambari    8

In [12]:
dict_numbers={1,2,3,4,5}   #set datatype 
dict_marks={85,45,96,97,37}
df=pd.DataFrame(dict_numbers,dict_marks,dtype=float)
df

      0
96  1.0
97  2.0
37  3.0
45  4.0
85  5.0


**[Slide No. 11]**

5. Create DataFrame and put index  

data = np.array(['a','b','c','d']) 

index=[100,101,102,103]

In [ ]:
data = np.array(['a','b','c','d'])

index=[100,101,102,103]

In [ ]:
import numpy as np
data = np.array(['a','b','c','d'])  #series 

index=[100,101,102,103]            #list of index

df = pd.DataFrame(data,index=index)

df

     0
100  a
101  b
102  c
103  d

**[Slide No. 11]**

6. Accessing Data from Series with Position

s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

In [13]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s
s['c']

3

In [14]:
Dict={
    'Name':['KRish',"Krishan","Ram",'Pallab','Raj'],
    'Age':[25,23,34,32,23],
    'Height':[5,6,5.5,6,5.9]
}
df=pd.DataFrame(Dict)
print(df)
df.iloc[0:2,]         #print First two rows
#df.iloc[1:3,0:2]     #print second and 3rd row and 1and 2nd col
#df.iloc[2:4,1:3]

#df.iloc[1:3,0:3:2]
df.iloc[1:3,[-1]]

      Name  Age  Height
0    KRish   25     5.0
1  Krishan   23     6.0
2      Ram   34     5.5
3   Pallab   32     6.0
4      Raj   23     5.9

   Height
1     6.0
2     5.5



7. Create a DataFrame in which you have 2 columns(Name , Age) .
And fill the data into this columns and use user define index

In [33]:

Dict={'Name': ['Rapolus','Mindaugus', 'Dominykas', 'Sargius','Varun'], 'Age':[27,30,25,31,22] }
index=[11,12,13,14,15]

df=pd.DataFrame(Dict, index)
df

         Name  Age
11    Rapolus   27
12  Mindaugus   30
13  Dominykas   25
14    Sargius   31
15      Varun   22

**[Slide No. 13]**

8. Read the Csv/Excel file and convert it into DataFrame .

In [ ]:
df=Pd.read_csv("Filename.csv")
df1=pd.read_excel("Filename.excel")

**[Slide No. 15]**

9. Print the top 5 and last 5 rows of the DataFrame

In [ ]:
df.head(5)
df.tail(5)

**[Slide No. 16]**

10. write a program to print 3 Row of the DataFrame .

In [ ]:
df.head(3)
df.iloc[0:3, :]

**[Slide No. 17]**

11. Write a Program to print First two Columns of the DataFrame.

In [ ]:
df.head(3)
df.iloc[:, 0:2]

**[Slide No .18]**

12.  Write a Program to filter the DataFrame and print First 2 row and first two column of the DataFrame.

In [ ]:
df.iloc[0:2:, 0:2]

**[Slide No. 19]**

13. Write a Program to Find the Null/missing value in the DataFrame.

In [ ]:
df.isnull().sum()
df.isnull().sum().any()

**[Slide No. 10]**

14. Create DataFrame from dict and list

In [43]:
#using dict
dict={'val1':[1,2,3,4], 'val2':[4,5,6,7]}
df1=pd.DataFrame(dict)
df1

   val1  val2
0     1     4
1     2     5
2     3     6
3     4     7

In [40]:
#Using list#
l1=[1,2,3,4,5,6,6]
l2=[3,45,58,99,88,98,99]
df=pd.DataFrame(list(zip(l1,l2)), columns=['val1','val2'], index=['a','b','c','d','e','f','h'])
df

   val1  val2
a     1     3
b     2    45
c     3    58
d     4    99
e     5    88
f     6    98
h     6    99

**[Slide No. 21]**

15. Write a Program to drop the rows which has null value.

In [ ]:
pd.dropna(axis=0)
#for column 
pd.dropna(axis=1)
pd.dropna(subset=[], axis=1)

[Slide No. 22]

16. Write a Program to remove Duplicate values in a Dataframe.

In [48]:
import pandas as pd
df1 = pd.DataFrame({'A':[1,2,3,4,5,6,2,7,3,9,10],
                     'B':[12,13,14,13,14,12,13,16,14,15,14]})
df1

     A   B
0    1  12
1    2  13
2    3  14
3    4  13
4    5  14
5    6  12
6    2  13
7    7  16
8    3  14
9    9  15
10  10  14

In [53]:
df1.drop_duplicates(subset=['A','B'], keep='last')

     A   B
0    1  12
3    4  13
4    5  14
5    6  12
6    2  13
7    7  16
8    3  14
9    9  15
10  10  14

**[Slide No . 24]**

17.  Adding a new column to an existing DataFrame object with column label by passing new series

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)



Q.1 Add new column in DataFrame


Q.2Adding a new column using the existing columns in DataFrame

In [60]:
    #[Slide No.24]**

#Delete the Column three from the DataFrame

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
     'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [61]:
df.drop("three",axis=1,inplace=True)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
**[Slide No. 24]**

19. write a program to  replace "Krish" from the age column

In [66]:
import pandas as pd

d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David',
                       'Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,"Krish",46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}


df = pd.DataFrame(d)

In [67]:
df

      Name    Age  Rating
0      Tom     25    4.23
1    James     26    3.24
2    Ricky     25    3.98
3      Vin     23    2.56
4    Steve     30    3.20
5    Smith     29    4.60
6     Jack     23    3.80
7      Lee     34    3.78
8    David     40    2.98
9   Gasper     30    4.80
10  Betina  Krish    4.10
11  Andres     46    3.65

In [68]:
df['Age']=df['Age'].replace("Krish",100)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina  100    4.10
11  Andres   46    3.65

In [69]:
import pandas as pd

df = pd.DataFrame({'A': [11, 21, 31],
                   'B': [12, 22, 32],
                   'C': [13, 23, 33]},
                  index=['ONE', 'TWO', 'THREE'])

print(df)
#         A   B   C
# ONE    11  12  13
# TWO    21  22  23
# THREE  31  32  33

        A   B   C
ONE    11  12  13
TWO    21  22  23
THREE  31  32  33

In [73]:
df1=df.rename(columns={'A':'Column1'})
df1

       Column1   B   C
ONE         11  12  13
TWO         21  22  23
THREE       31  32  33

**[Slide No .32]**

20. Write a program to join two dataframe and do multiple joins.

In [182]:
data1 = pd.DataFrame({'A': ['K0', 'K1', 'K2', 'K3'],
                     'B': ['L0', 'L1', 'L2', 'L3'],}, index=[1,2,3,4],)

In [192]:
data2 = pd.DataFrame({'C': ['K0', 'K1', 'K2', 'K3'],
                     'D': ['L0', 'L1', 'L2', 'L3'],}, index=[1,2,3,4],)

In [193]:
frames = [data1,data2]

In [194]:
A=pd.concat(frames)
A

     A    B    C    D
1   K0   L0  NaN  NaN
2   K1   L1  NaN  NaN
3   K2   L2  NaN  NaN
4   K3   L3  NaN  NaN
1  NaN  NaN   K0   L0
2  NaN  NaN   K1   L1
3  NaN  NaN   K2   L2
4  NaN  NaN   K3   L3

In [202]:
data1 = pd.DataFrame({'A': ['K0', 'K1', 'K2', 'K3'],
                     'B': ['L0', 'L1', 'L2', 'L3'],}, index=[1,2,3,4],)

In [203]:
data2 = pd.DataFrame({'A': ['K0', 'K1', 'K2', 'K3'],
                     'B': ['L0', 'L1', 'L2', 'L3'],}, index=[5,6,7,8],)

In [204]:
A1=data1.append(data2)
A1

    A   B
1  K0  L0
2  K1  L1
3  K2  L2
4  K3  L3
5  K0  L0
6  K1  L1
7  K2  L2
8  K3  L3

In [205]:
result = pd.concat(frames, keys=["x", "y",])
result

       A    B    C    D
x 1   K0   L0  NaN  NaN
  2   K1   L1  NaN  NaN
  3   K2   L2  NaN  NaN
  4   K3   L3  NaN  NaN
y 1  NaN  NaN   K0   L0
  2  NaN  NaN   K1   L1
  3  NaN  NaN   K2   L2
  4  NaN  NaN   K3   L3

In [206]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [207]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [208]:
a=pd.concat([df1,df4], axis=1)
a

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [231]:
A2=df1.append(df4)
A2

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [212]:
#inner join

In [213]:
result = pd.concat([df1, df4], axis=1, join="inner")
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [215]:
result = pd.concat([df1, df4], axis=1).reindex(df1.index)
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [217]:
result1=df1.append(df4,ignore_index=True)
result1

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [218]:
result1=df1.append(df4)
result1

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [222]:
left = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


right = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)


result = pd.merge(left, right, on=["key1", "key2"])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [224]:
result = pd.merge(left, right, how='inner', on=["key1", "key2"])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [225]:
result = pd.merge(left, right, how='left', on=["key1", "key2"])
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [226]:
result = pd.merge(left, right, how='right', on=["key1", "key2"])
result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [227]:
result = pd.merge(left, right, how='outer', on=["key1", "key2"])
result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [230]:
result = pd.merge(left, right, how='cross')
result

   key1_x key2_x   A   B key1_y key2_y   C   D
0      K0     K0  A0  B0     K0     K0  C0  D0
1      K0     K0  A0  B0     K1     K0  C1  D1
2      K0     K0  A0  B0     K1     K0  C2  D2
3      K0     K0  A0  B0     K2     K0  C3  D3
4      K0     K1  A1  B1     K0     K0  C0  D0
5      K0     K1  A1  B1     K1     K0  C1  D1
6      K0     K1  A1  B1     K1     K0  C2  D2
7      K0     K1  A1  B1     K2     K0  C3  D3
8      K1     K0  A2  B2     K0     K0  C0  D0
9      K1     K0  A2  B2     K1     K0  C1  D1
10     K1     K0  A2  B2     K1     K0  C2  D2
11     K1     K0  A2  B2     K2     K0  C3  D3
12     K2     K1  A3  B3     K0     K0  C0  D0
13     K2     K1  A3  B3     K1     K0  C1  D1
14     K2     K1  A3  B3     K1     K0  C2  D2
15     K2     K1  A3  B3     K2     K0  C3  D3